title: Unusual process execution
id: 12ec88c7-ab94-422f-a4b4-08ab7df2e330
status: Experimental
references:
    - https://attack.mitre.org/techniques/T1082/
    - https://github.com/redcanaryco/atomic-red-team
Description: Event ID 1- Process Execution. Tested using atomic red team
author: DGP2020
date: 2026/06/04
tags:
   - attack.discovery
   - attack.t1082
logsource:
    product:  Windows
    service:  Sysmon
    category: process_creation
detection:
     selection_parent:
        ParentImage|endswith:
         -'\powershell.exe'
         -'\pwsh.exe'
     selection_child:
        Image|endswith:
          -'\reg.exe'
          -'\systeminfo.exe'
     selection_child_cmd:  
        CommandLine|contains:
           -'query'
           -'HKLM\Software\Microsoft\Windows NT\CurrentVersion'      
     condition: selection_parent and selection_child and selection_child_cmd
falsepositives:
     - System audit scripts and asset management scripts could be flagged
level: medium 
    
